# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefinitionGroups..::..Contains Method
DefinitionGroups Class See Also
---
Tests for the existence of a definition group within the collection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Contains(
	DefinitionGroup definitionGroup
)
```

Visual Basic
---
```text
Public Function Contains ( _
	definitionGroup As DefinitionGroup _
) As Boolean
```

Visual C++
---
```text
public:
bool Contains(
	DefinitionGroup^ definitionGroup
)
```

# ### Parameters
definitionGroup
    Type: Autodesk.Revit.DB..::..DefinitionGroupThe definition group to look for.
# ### Return Value
True if the definition group was found, false otherwise.
# See Also
DefinitionGroups Class
Autodesk.Revit.DB Namespace